# Pandas

In this lab you are going to learn the Pandas API to process data.

In [ ]:
import numpy as np
import pandas as pd
pd.__version__

'1.0.5'

# Series

## From list, ndarray, dictionary

In [ ]:
obj = pd.Series([2, 1, -3, 3])
print(obj, obj.tolist())
obj = pd.Series(np.array([2, 1, -3, 3]))
print(obj, obj.tolist())
temp_dict = {'Jan':-10, 'Feb':8, 'Mar':13, 'Apr':20, 'May':30}
temp_series = pd.Series(temp_dict)
print(temp_series)

0    2
1    1
2   -3
3    3
dtype: int64 [2, 1, -3, 3]
0    2
1    1
2   -3
3    3
dtype: int64 [2, 1, -3, 3]
Jan   -10
Feb     8
Mar    13
Apr    20
May    30
dtype: int64

In [ ]:
month =['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun']
temp_series = pd.Series(data=temp_dict, index=month)
temp_series
# pd.isnull(temp_series)

Jan   -10.0
Feb     8.0
Mar    13.0
Apr    20.0
May    30.0
Jun     NaN
dtype: float64

## Series Index & Values

In [ ]:
obj = pd.Series([2, 1, -3, 3])
print(obj.index)
print(obj.values)

RangeIndex(start=0, stop=4, step=1)
[ 2  1 -3  3]

- Reindexing a Series

In [ ]:
s = pd.Series(data = [1,2,3,4,5], index = ['A', 'B', 'C','D','E'])
print("Original Data Series:")
print(s)
s = s.reindex(index = ['B','A','C','D','E'])
print(s)

Original Data Series:
A    1
B    2
C    3
D    4
E    5
dtype: int64
B    2
A    1
C    3
D    4
E    5
dtype: int64

In [ ]:
obj2 = pd.Series(data=[2, 1, -3, 3], 
              index=['a', 'b', 'c', 'd'])
print(obj2, type(obj2))
print(obj2.values, type(obj2.values))
print(obj2.values.tolist(), type(obj2.values.tolist()))

a    2
b    1
c   -3
d    3
dtype: int64 <class 'pandas.core.series.Series'>
[ 2  1 -3  3] <class 'numpy.ndarray'>
[2, 1, -3, 3] <class 'list'>

## Filtering and Searching values
Using logical conditions, index

In [ ]:
obj2[obj2 < 2]

b    1
c   -3
dtype: int64

In [ ]:
obj2[['a', 'd']]

a    2
d    3
dtype: int64

In [ ]:
pd.Series([1,2,3,4, pd.NA]).isnull()

0    False
1    False
2    False
3    False
4     True
dtype: bool

## Arithmetic Operations & Stats

In [ ]:
obj2 * 2

a    4
b    2
c   -6
d    6
dtype: int64

In [ ]:
import numpy as np
np.exp(obj2)
# np.exp(obj2.values) # check the difference

a     7.389056
b     2.718282
c     0.049787
d    20.085537
dtype: float64

In [ ]:
import pandas as pd
ds1 = pd.Series([2, 4, 6, 8, 10])
ds2 = pd.Series([1, 3, 5, 7, 9])
print(ds1 + ds2)
print(ds1 * ds2)
print(ds1 / ds2)

In [ ]:
s = pd.Series(data = [1,2,3,4,5,6,7,8,9,5,3])
print("Mean of the said Data Series:{0}".format(s.mean()))
print("Standard deviation of the said Data Series: {0}".format(s.std()))
print("Variance of the Data Series: {0}".format(s.var()))
print("Variance of the Data Series: {0}".format(s.quantile(q=0.1)))
print("Min, Max and median of the Data Series: {0}, {1}, {2}".format(s.min(), s.max(), s.median()))

- Sample Frequency Distribution

In [ ]:
num_series = pd.Series([1, 1, 1, 2, 2, 1, 2, 4, 5, 3])
print("Frequency of each unique value of the said series.")
result = num_series.value_counts()
# result = num_series.sort_values().value_counts()
print(result)
print(type(result))

- autocorrelation

In [ ]:
num_series = pd.Series([1, 1, 1, 2, 2, 1, 2, 4, 5, 3])
num_series.autocorr(lag=1)

0.6488856845230502

- argmax()

In [ ]:
num_series = pd.Series([1, 1, 1, 2, 2, 1, 2, 4, 5, 3])
num_series.argmax()

8

## Logical Operations

In [ ]:
import pandas as pd
ds1 = pd.Series([2, 4, 6, 8, 10])
ds2 = pd.Series([1, 3, 5, 7, 9])
print(ds1 > ds2)
print(ds1 == ds2)
print(ds1 % ds2 == 0)
print(ds1[ds1 % 5 == 0].index)

0    True
1    True
2    True
3    True
4    True
dtype: bool
0    False
1    False
2    False
3    False
4    False
dtype: bool
0     True
1    False
2    False
3    False
4    False
dtype: bool
4

In [ ]:
ds1[[1,2,3]]
ds1.take([1,2,3])

1    4
2    6
3    8
dtype: int64

## Set Difference
- Series.isin()

In [ ]:
sr1 = pd.Series([1, 2, 3, 4, 5])
sr2 = pd.Series([2, 4, 6, 8, 10])
print("Items of sr1 not present in sr2:", sr1[~sr1.isin(sr2)])
print("Items of sr2 not present in sr1:", sr2[~sr2.isin(sr1)])
print("Items of sr1 present in sr2:\n", sr1[sr1.isin(sr2)])
print("Items of sr2 present in sr1:\n", sr2[sr2.isin(sr1)])

Items of sr1 not present in sr2: 0    1
2    3
4    5
dtype: int64
Items of sr2 not present in sr1: 2     6
3     8
4    10
dtype: int64
Items of sr1 present in sr2:
 1    2
3    4
dtype: int64
Items of sr2 present in sr1:
 0    2
1    4
dtype: int64

## Linear Algebric operation

### Euclidean Distance

In [ ]:
x = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
y = pd.Series([11, 8, 7, 5, 6, 5, 3, 4, 7, 1])
print("Original series:")
print(x)
print(y)
print("\nEuclidean distance between two said series:")
print(np.linalg.norm(norm(x-y))
Copy
Sample Output:

## Differencing a Series

In [ ]:
series1 = pd.Series([1, 3, 5, 8, 10, 11, 15])
print("Original Series:")
print(series1)
print("\nDifference of differences between consecutive numbers of the said series:")
print(series1.diff().tolist())

Original Series:
0     1
1     3
2     5
3     8
4    10
5    11
6    15
dtype: int64

Difference of differences between consecutive numbers of the said series:
[nan, 2.0, 2.0, 3.0, 2.0, 1.0, 4.0]

## Changing Data Type

- astype()

In [ ]:
import pandas as pd
s1 = pd.Series(['1', '2', '3', '4', '5'])
s1.astype(int)

0    1
1    2
2    3
3    4
4    5
dtype: int64

- pd.to_numeric

In [ ]:
import pandas as pd
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
s2 = pd.to_numeric(s1, errors='coerce')
s2

0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

- pd.to_datetime, Time Series

In [ ]:
import pandas as pd
date_series = pd.Series(['01 Jan 2015', '10-02-2016', '20180307', '2014/05/06', '2016-04-12', '2019-04-06T11:20'])
print("Original Series:")
print(date_series)
print("\nSeries of date strings to a timeseries:")
time_series = pd.to_datetime(date_series)
print(time_series)
# time_series.dt.year
# time_series.dt.month
# time_series.dt.day
# time_series.dt.day_name
# time_series.dt.date

Original Series:
0         01 Jan 2015
1          10-02-2016
2            20180307
3          2014/05/06
4          2016-04-12
5    2019-04-06T11:20
dtype: object

Series of date strings to a timeseries:
0   2015-01-01 00:00:00
1   2016-10-02 00:00:00
2   2018-03-07 00:00:00
3   2014-05-06 00:00:00
4   2016-04-12 00:00:00
5   2019-04-06 11:20:00
dtype: datetime64[ns]

0    2015-01-01
1    2016-10-02
2    2018-03-07
3    2014-05-06
4    2016-04-12
5    2019-04-06
dtype: object

## Time Series

## Combining Multiple Series

In [ ]:
import pandas as pd
s = pd.Series([
    ['Red', 'Green', 'White'],
    ['Red', 'Black'],
    ['Yellow']])
print("Original Series of list")
print(s)
s = s.apply(pd.Series).stack()
print(s)
s = s.apply(pd.Series).stack().reset_index(drop=True)
print(s)

Original Series of list
0    [Red, Green, White]
1           [Red, Black]
2               [Yellow]
dtype: object
0  0       Red
   1     Green
   2     White
1  0       Red
   1     Black
2  0    Yellow
dtype: object
0       Red
1     Green
2     White
3       Red
4     Black
5    Yellow
dtype: object

## Adding / Removing values
Similar to python list, append method is used to add data to an existing Series object.

In [ ]:
import pandas as pd
s = pd.Series(['100', '200', 'python', '300.12', '400'])
print("Original Data Series:")
print(s)
print("\nData Series after adding some data:")
new_s = s.append(pd.Series(['500', 'php']))
print(new_s)

Original Data Series:
0       100
1       200
2    python
3    300.12
4       400
dtype: object

Data Series after adding some data:
0       100
1       200
2    python
3    300.12
4       400
0       500
1       php
dtype: object

## Sorting Series by values

In [ ]:
import pandas as pd
s = pd.Series([3, 1, 2, 4, 5, 1])
print("Original Data Series:")
print(s)
new_s = s.sort_values()
# new_s = pd.Series.sort_values(s) # equivalent
print(new_s)

Original Data Series:
0    3
1    1
2    2
3    4
4    5
5    1
dtype: int64
1    1
5    1
2    2
0    3
3    4
4    5
dtype: int64

## mapping a function

In [ ]:
import pandas as pd
series1 = pd.Series(['Php', 'Python', 'Java', 'C#'])
print("Original Series:")
print(series1)
result = series1.map(lambda x: len(x))
print(result)
print(series1.map(lambda x: len(x)).max())

Original Series:
0       Php
1    Python
2      Java
3        C#
dtype: object
0    3
1    6
2    4
3    2
dtype: int64
6

# DataFrame

In [ ]:
temp_df = pd.DataFrame(data=temp_series, columns=['Temp'])
temp_df

     Temp
Jan -10.0
Feb   8.0
Mar  13.0
Apr  20.0
May  30.0
Jun   NaN

In [ ]:
temp_df['Temp']

Jan   -10.0
Feb     8.0
Mar    13.0
Apr    20.0
May    30.0
Jun     NaN
Name: Temp, dtype: float64

In [ ]:
temp_df.loc['Jan']

Temp   -10.0
Name: Jan, dtype: float64

In [ ]:
temp_df['Humid'] = pd.Series({'Jan':23, 'Feb':30, 'Mar':33, 'Apr':40, 'Jun':30})

In [ ]:
temp_df

     Temp  Humid
Jan -10.0   23.0
Feb   8.0   30.0
Mar  13.0   33.0
Apr  20.0   40.0
May  30.0    NaN
Jun   NaN   30.0

In [ ]:
sales = [{'account': 'Jones LLC', 'Jan': 150, 'Feb': 200, 'Mar': 140},
         {'account': 'Alpha Co',  'Jan': 200, 'Feb': 210, 'Mar': 215},
         {'account': 'Blue Inc',  'Jan': 50,  'Feb': 90,  'Mar': 95 }]
df = pd.DataFrame(sales)
df

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

In [ ]:
from collections import OrderedDict
sales = OrderedDict([ ('account', ['Jones LLC', 'Alpha Co', 'Blue Inc']),
          ('Jan', [150, 200, 50]),
          ('Feb',  [200, 210, 90]),
          ('Mar', [140, 215, 95]) ] )
df = pd.DataFrame.from_dict(sales)
df

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

## From csv

In [ ]:
pd.read_csv('movies_metadata.csv')

## From Lists

In [ ]:
sales = {'account': ['Jones LLC', 'Alpha Co', 'Blue Inc'],
         'Jan': [150, 200, 50],
         'Feb': [200, 210, 90],
         'Mar': [140, 215, 95]}
df_sales = pd.DataFrame.from_dict(sales)

## From Records

In [ ]:
sales = [('Jones LLC', 150, 200, 50),
         ('Alpha Co', 200, 210, 90),
         ('Blue Inc', 140, 215, 95)]
labels = ['account', 'Jan', 'Feb', 'Mar']
df = pd.DataFrame.from_records(sales, columns=labels)
df

     account  Jan  Feb  Mar
0  Jones LLC  150  200   50
1   Alpha Co  200  210   90
2   Blue Inc  140  215   95

## From Dictionary

In [ ]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df_exam_data = pd.DataFrame(exam_data)

## From multiple Series

In [ ]:
s1 = pd.Series(['a', 'b', 'c'])
s2 = pd.Series([1,2,3])
df = pd.concat([s1, s2], axis=1)
df

   0  1
0  a  1
1  b  2
2  c  3

### From numpy ndarray

In [ ]:
values = np.ones(10)
df = pd.DataFrame(values)
df

## Accessing data in DataFrame

### by index: iloc

In [ ]:
import pandas as pd
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
s1 = df.iloc[:,0]
s1

0     1
1     2
2     3
3     4
4     7
5    11
Name: col1, dtype: int64

In [ ]:
df_exam_data.iloc[[1, 3, 5, 6], [1, 3]]

   score qualify
1    9.0      no
3    NaN      no
5   20.0     yes
6   14.5     yes

### using column name

In [ ]:
df_exam_data['attempts']
df_exam_data.attempts

a    1
b    3
c    2
d    3
e    2
f    3
g    1
h    1
i    2
j    1
Name: attempts, dtype: int64

In [ ]:
# all Series functions are applicable to individual columns because each columns is an object of Series class
df_exam_data.attempts.sum()
df_exam_data.attempts.mean()
df_exam_data.attempts.min()

1

### using logical operators

In [ ]:
df_exam_data[df_exam_data['attempts'] > 2]
df_exam_data[df_exam_data.attempts > 2] # equivalent

      name  score  attempts qualify
1     Dima    9.0         3      no
3    James    NaN         3      no
5  Michael   20.0         3     yes

## Updating DataFrame values

### using loc

In [ ]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

print(df_exam_data)
df_exam_data.loc['d', 'score'] = 11.5
print(df_exam_data)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

### using column name

In [ ]:
df_exam_data['name'] = df_exam_data['name'].replace('James', 'Suresh')

## Updating DataFrame Columns

- remove

In [ ]:
df_exam_data.pop('attempts')
df_exam_data

- add a column

In [ ]:
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']
df_exam_data['color'] = color
df_exam_data

        name  score qualify   color
a  Anastasia   12.5     yes     Red
b       Dima    9.0      no    Blue
c  Katherine   16.5     yes  Orange
d      James   11.5      no     Red
e      Emily    9.0      no   White
f    Michael   20.0     yes   White
g    Matthew   14.5     yes    Blue
h      Laura    NaN      no   Green
i      Kevin    8.0      no   Green
j      Jonas   19.0     yes     Red

- add a column using concat

In [ ]:
df = pd.DataFrame({'c1':['a', 'b', 'c']})
s2 = pd.Series([1,2,3], name='c2')
pd.concat([df, s2], axis=1)

  c1  c2
0  a   1
1  b   2
2  c   3

- Change column name

In [ ]:
df = pd.DataFrame({'c1':['a', 'b', 'c']})
print(df)
# df=df.rename(columns={'c1':'c1_new_name'}, inplace=False)
df.rename(columns={'c1':'c1_new_name'}, inplace=True)
print(df)

  c1
0  a
1  b
2  c
  c1_new_name
0           a
1           b
2           c

## Updating DataFrame Rows

- add rows append()

In [ ]:
df2 = {'name': 'Adam', 'score': 11, 'qualify': 'no'}
df = df_exam_data.append(df2, ignore_index=True) # Can only append a Series if ignore_index=True or if the Series has a name
df

         name  score qualify   color
0   Anastasia   12.5     yes     Red
1        Dima    9.0      no    Blue
2   Katherine   16.5     yes  Orange
3       James   11.5      no     Red
4       Emily    9.0      no   White
5     Michael   20.0     yes   White
6     Matthew   14.5     yes    Blue
7       Laura    NaN      no   Green
8       Kevin    8.0      no   Green
9       Jonas   19.0     yes     Red
10       Adam   11.0      no     NaN

- remove rows using drop()

In [ ]:
df_ = df.drop(df.index[10])
df_

        name  score qualify   color
0  Anastasia   12.5     yes     Red
1       Dima    9.0      no    Blue
2  Katherine   16.5     yes  Orange
3      James   11.5      no     Red
4      Emily    9.0      no   White
5    Michael   20.0     yes   White
6    Matthew   14.5     yes    Blue
7      Laura    NaN      no   Green
8      Kevin    8.0      no   Green
9      Jonas   19.0     yes     Red

In [ ]:
sales = {'account': ['Jones LLC', 'Alpha Co', 'Blue Inc'],
         'Jan': [150, 200, 50],
         'Feb': [200, 210, 90],
         'Mar': [140, 215, 95]}
df_sales = pd.DataFrame.from_dict(sales)
df_sales = df_sales.drop(df_sales.index[0])
print(df_sales)

    account  Jan  Feb  Mar
1  Alpha Co  200  210  215
2  Blue Inc   50   90   95

In [ ]:
df_sales.reset_index()

   index   account  Jan  Feb  Mar
0      1  Alpha Co  200  210  215
1      2  Blue Inc   50   90   95

- remove rows using logical conditions

In [ ]:
df_ = df[df.name != 'Adam']
df_

        name  score qualify   color
0  Anastasia   12.5     yes     Red
1       Dima    9.0      no    Blue
2  Katherine   16.5     yes  Orange
3      James   11.5      no     Red
4      Emily    9.0      no   White
5    Michael   20.0     yes   White
6    Matthew   14.5     yes    Blue
7      Laura    NaN      no   Green
8      Kevin    8.0      no   Green
9      Jonas   19.0     yes     Red

## Useful views, properties and functions

### head()

In [ ]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df_exam_data = pd.DataFrame(exam_data, index=labels)
df_exam_data.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

### describe()

In [ ]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df_exam_data = pd.DataFrame(exam_data, index=labels)
df_exam_data.describe()

           score   attempts
count   8.000000  10.000000
mean   13.562500   1.900000
std     4.693746   0.875595
min     8.000000   1.000000
25%     9.000000   1.000000
50%    13.500000   2.000000
75%    17.125000   2.750000
max    20.000000   3.000000

### nlargest()

In [ ]:
df_exam_data.nlargest(3, 'score')

        name  score  attempts qualify
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes
c  Katherine   16.5         2     yes

### duplicated()

In [ ]:
df =  pd.DataFrame({'c1':[1,1,1], 'c2':[1,1,3]})
print(df)
print(df[df.duplicated()])
print(df.duplicated().sum())

   c1  c2
0   1   1
1   1   1
2   1   3
   c1  c2
1   1   1
1

In [ ]:
df.c1.duplicated()

0    False
1     True
2     True
Name: c1, dtype: bool

### df.info(memory_usage)

In [ ]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      3 non-null      int64
 1   c2      3 non-null      int64
dtypes: int64(2)
memory usage: 176.0 bytes

### Transpose

In [ ]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df_exam_data = pd.DataFrame(exam_data, index=labels)

In [ ]:
df_exam_data.T

                  a     b          c      d  ...        g      h      i      j
name      Anastasia  Dima  Katherine  James  ...  Matthew  Laura  Kevin  Jonas
score          12.5     9       16.5    NaN  ...     14.5    NaN      8     19
attempts          1     3          2      3  ...        1      1      2      1
qualify         yes    no        yes     no  ...      yes     no     no    yes

[4 rows x 10 columns]

### axes

In [ ]:
df_exam_data.axes

[Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object'),
 Index(['name', 'score', 'qualify', 'color'], dtype='object')]

### columns

In [ ]:
df_exam_data.columns.values

array(['name', 'score', 'qualify', 'color'], dtype=object)

### shape

In [ ]:
df_exam_data.shape

(10, 4)

### Missing values isnull()

In [ ]:
df_exam_data[df_exam_data['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

- counting all NaN values in a DataFrame

In [ ]:
df_exam_data.isnull().values.sum()

2

### Sorting DataFrame sort_values()

In [ ]:
df_exam_data.sort_values(by=['name'])

### Iterating DataFrame rows

In [ ]:
for index, row in df_exam_data.iterrows():
    print(row['name'], row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5
James 11.5
Emily 9.0
Michael 20.0
Matthew 14.5
Laura nan
Kevin 8.0
Jonas 19.0

### Statistical Sampling & Shuffeling

In [ ]:
df_x = pd.DataFrame({"scores": [1,2,3,4,5,6,7,8,9,10]})
df_x_train = df_x.sample(frac=0.7) # random_state=10
df_x_test = df_x.drop(df_x_train.index)
df_x_test

   scores
0       1
7       8
9      10

In [ ]:
df_x = pd.DataFrame({"scores": [1,2,3,4,5,6,7,8,9,10]})
df_shuffel = df_x.sample(frac=1) # random_state=10
df_shuffel

   scores
2       3
7       8
4       5
3       4
5       6
8       9
0       1
9      10
6       7
1       2

# Exercises
1. Filter words from a given series that contain atleast two vowels

In [ ]:
# hint: series.map(lambda c: sum([Counter(c.lower()).get(i, 0) for i in list('aeiou')]) >= 2)

2. Find peaks in a series. Values neigbored by two smaller values.

In [ ]:
nums = pd.Series([1, 8, 7, 5, 6, 5, 3, 4, 7, 1])
diff_sign = (nums.diff())/(nums.diff().abs())
print(diff_sign)
diff2 = diff_sign.diff()
nums[diff2[diff2 == -2].index - 1]

3. Compute the autocorrelations of a given numeric series

In [ ]:
nums = pd.Series([1, 8, 7, 5, 6, 5, 3, 4, 7, 1])
autocorrelations = [nums.autocorr(i).round(2) for i in range(nums.count())]
autocorrelations

4. Working with datasets
 - Using the movies dataset, 
    - write a Pandas program to display the movies (title, runtime) longer than 30 minutes and shorter than 360 minutes. [Hint: df[ (df.col >= X) & (df.col2 <= Y)]]
    - Write a Pandas program to calculate the number of votes garnered by the 80% of the movies. [Hint: quantile(0.70)]
    - Write a Pandas program to access those movies, released after 1995-01-01.
 - Using the diamonds dataset
    - Write a Pandas program to get sample 75% of the diamonds DataFrame's rows without replacement and store the remaining 25% of the rows in another DataFrame. [Hint: sample(0.70)]
    - Write a Pandas program to read rows in which the 'cut' is 'Premium', column 'color' of diamonds DataFrame. [Hint: diamonds.loc[diamonds.cut=='Premium', 'color']
    - Write a Pandas program to calculate the multiply of length, width and depth for each cut of diamonds DataFrame.